  export const RESONANCE_TEXT = `在高中阶段，我们已经学习过苯有两种画法：
  
  1. 交替画出单双键的凯库勒式；
  2. 在六元环中画一个圆圈。
  
  :::
    {
      "m": [
        {
          "i": "m1",
          "a": [
            {"x": 100, "y": 70, "l": "C"},
            {"x": 126, "y": 85, "l": "C"},
            {"x": 126, "y": 115, "l": "C"},
            {"x": 100, "y": 130, "l": "C"},
            {"x": 74, "y": 115, "l": "C"},
            {"x": 74, "y": 85, "l": "C"}
          ],
          "b": [
            {"b": 0, "e": 1, "o": 2, "clr": "var(--chem-blue)"},
            {"b": 1, "e": 2, "o": 1},
            {"b": 2, "e": 3, "o": 2, "clr": "var(--chem-blue)"},
            {"b": 3, "e": 4, "o": 1},
            {"b": 4, "e": 5, "o": 2, "clr": "var(--chem-blue)"},
            {"b": 5, "e": 0, "o": 1}
          ]
        },
        {
          "i": "m2",
          "a": [
            {"x": 260, "y": 70, "l": "C"},
            {"x": 286, "y": 85, "l": "C"},
            {"x": 286, "y": 115, "l": "C"},
            {"x": 260, "y": 130, "l": "C"},
            {"x": 234, "y": 115, "l": "C"},
            {"x": 234, "y": 85, "l": "C"}
          ],
          "b": [
            {"b": 0, "e": 1, "o": 1.5, "clr": "var(--chem-blue)"},
            {"b": 1, "e": 2, "o": 1.5, "clr": "var(--chem-blue)"},
            {"b": 2, "e": 3, "o": 1.5, "clr": "var(--chem-blue)"},
            {"b": 3, "e": 4, "o": 1.5, "clr": "var(--chem-blue)"},
            {"b": 4, "e": 5, "o": 1.5, "clr": "var(--chem-blue)"},
            {"b": 5, "e": 0, "o": 1.5, "clr": "var(--chem-blue)"}
          ]
        }
      ],
      "s": [
        {"t": "Line", "x1": 155, "y1": 100, "x2": 205, "y2": 100, "a": "synthetic"}
      ]
    }
  :::
  
  经典结构认为苯具有交替的单双键，但是苯无法与溴水加成等一系列实验事实表明苯的化学键并非如乙烯那样的双键。后来科学家发现苯具有六根等长共价键，每根键都介于单双键之间。它可以**想象为**部分双键的 $\\pi$ 键电子转移到了单键上、使得每根键都是“1.5 键”（键级为 1.5）的结果。
  
  这种电子并不局限在两个原子核之间，而是分布在多个原子之间的状态，叫做**电子离域**，也可以用**大 $\\pi$ 键**来描述。
  
  为了更准确地描述电子离域现象对有机物性质的影响并解释反应机理，科学家提出**共振理论**。共振理论将多个经典结构用双向共振箭头连接，以它们的加权平均描述真实的分子。这些结构称为极限结构，它们并非真实存在，于是也不存在某种动态平衡。真实的分子是它们的“共振杂化体”，而非一种混合物。
  
  例如，苯可以通过以下两种极限结构描述。两种极限结构同样稳定，因此对共振杂化体的贡献是等价的，苯的共价键因而呈现出“1.5 键“的性质。
  
  :::
    {
      "m": [
        {
          "i": "m1",
          "a": [
            {"x": 100, "y": 70, "i": "a0", "l": "C"},
            {"x": 126, "y": 85, "i": "a1", "l": "C"},
            {"x": 126, "y": 115, "i": "a2", "l": "C"},
            {"x": 100, "y": 130, "i": "a3", "l": "C"},
            {"x": 74, "y": 115, "i": "a4", "l": "C"},
            {"x": 74, "y": 85, "i": "a5", "l": "C"}
          ],
          "b": [
            {"b": 0, "e": 1, "o": 2, "i": "b0", "clr": "var(--chem-blue)"},
            {"b": 1, "e": 2, "o": 1, "i": "b1"},
            {"b": 2, "e": 3, "o": 2, "i": "b2", "clr": "var(--chem-blue)"},
            {"b": 3, "e": 4, "o": 1, "i": "b3"},
            {"b": 4, "e": 5, "o": 2, "i": "b4", "clr": "var(--chem-blue)"},
            {"b": 5, "e": 0, "o": 1, "i": "b5"}
          ]
        },
        {
          "i": "m2",
          "a": [
            {"x": 260, "y": 70, "l": "C"},
            {"x": 286, "y": 85, "l": "C"},
            {"x": 286, "y": 115, "l": "C"},
            {"x": 260, "y": 130, "l": "C"},
            {"x": 234, "y": 115, "l": "C"},
            {"x": 234, "y": 85, "l": "C"}
          ],
          "b": [
            {"b": 0, "e": 1, "o": 1, "clr": "var(--chem-blue)"},
            {"b": 1, "e": 2, "o": 2},
            {"b": 2, "e": 3, "o": 1, "clr": "var(--chem-blue)"},
            {"b": 3, "e": 4, "o": 2},
            {"b": 4, "e": 5, "o": 1, "clr": "var(--chem-blue)"},
            {"b": 5, "e": 0, "o": 2}
          ]
        }
      ],
      "s": [
        {"t": "Line", "x1": 150, "y1": 100, "x2": 210, "y2": 100, "a": "resonance"},
        {"t": "Pusher", "o1": "b0", "o2": "b1", "e": 2},
        {"t": "Pusher", "o1": "b2", "o2": "b3", "e": 2},
        {"t": "Pusher", "o1": "b4", "o2": "b5", "e": 2}
      ]
    }
  :::
  
  此处需要说明图示所用的**弯箭头语法**，我们今后将在反应机理中也常常用到它。弯箭头用于追踪反应中电子的流动方向，其起点代表电子的来源，一般是孤对电子或化学键；箭头指向代表电子去向，一般是形成新键或变成孤对电子。
  
  共振论是应用电子离域的理论，而发生电子离域的原因将于[「共轭效应」](/learn/conjugation)中介绍。本章只给出由熟知的经典式便捷判断、画出其他共振结构的方法，以便读者运用它理解许多化学现象。
  
  简单地说：
  
  > 一根共价键可以转移为一根相邻键或相邻原子的一对孤对电子，相邻原子孤对电子也可以转移到这个原子的键上。形式电荷作相应变化。
  
  以下先以烯丙基阳离子 $\\text{CH}_2{=}\\text{CH}{-}\\text{CH}_2^+$ 为例说明这一规则。
  
  :::
    {
      "m": [
        {
          "i": "m1",
          "a": [
            {"x": 50, "y": 100, "l": "C"},
            {"x": 80, "y": 80, "l": "C"},
            {"x": 110, "y": 100, "l": "C", "c": 1, "i": "a2", "clr": "var(--chem-rust)"}
          ],
          "b": [
            {"b": 0, "e": 1, "o": 2, "i": "b0", "clr": "var(--chem-blue)"},
            {"b": 1, "e": 2, "o": 1, "i": "b1"}
          ]
        },
        {
          "i": "m2",
          "a": [
            {"x": 210, "y": 100, "l": "C", "c": 1, "clr": "var(--chem-rust)"},
            {"x": 240, "y": 80, "l": "C"},
            {"x": 270, "y": 100, "l": "C"}
          ],
          "b": [
            {"b": 0, "e": 1, "o": 1},
            {"b": 1, "e": 2, "o": 2, "clr": "var(--chem-blue)"}
          ]
        }
      ],
      "s": [
        {"t": "Line", "x1": 135, "y1": 90, "x2": 185, "y2": 90, "a": "resonance"},
        {"t": "Pusher", "o1": "b0", "o2": "b1", "e": 2}
      ]
    }
  :::
  
  右侧<ce style="color: var(--chem-rust);">碳原子</ce>只成三根键，按照形式电荷的计算规则（成键原子均分成键电子对），带有 $+1$ 的形式电荷。右侧<ce style="color:var(--chem-rust)">带正电的碳原子</ce>缺电子，相邻<ce style="color:var(--chem-blue)">双键 $\\pi$ 电子</ce>可以向这块空缺区域流动，转移为中心碳和右侧碳间的双键。这使得右侧碳原子不再带有正电荷，而左侧端基碳原子则少了一根键（少“分得”一个电子），带上 $+1$ 的形式电荷。
  
  需要明确，这里和本文余下部分称电子发生“流动”“转移”“驱赶”及“原”结构等表述只是有助于根据一种共振式想象出、画出其他共振式的启发法，不代表任何实际意义上的动态平衡。
  
  注意到在书写不同的共振式时，分子的单键骨架以及各原子核的位置总是保持不变；只有不饱和键或孤对电子允许发生位置移动。
  
  如果分子带有负电荷，富余的电子同样可以通过相似的机制推向不饱和键，例如结构为 $\\text{CH}_2{=}\\text{CH}{-}\\text{CH}_2^-$ 的烯丙基阴离子。
  
  :::
    {
      "m": [
        {
          "i": "m1",
          "a": [
            {"x": 50, "y": 100, "i": "a0", "l": "C", "p": 0},
            {"x": 80, "y": 80, "i": "a1", "l": "C"},
            {"x": 110, "y": 100, "i": "a2", "l": "C", "c": -1, "p": 1, "clr": "var(--chem-green)"}
          ],
          "b": [
            {"b": 0, "e": 1, "o": 2, "i": "b0", "clr": "var(--chem-blue)"},
            {"b": 1, "e": 2, "o": 1, "i": "b1"}
          ]
        },
        {
          "i": "m2",
          "a": [
            {"x": 210, "y": 100, "l": "C", "c": -1, "p": 1, "clr": "var(--chem-indigo)"},
            {"x": 240, "y": 80, "l": "C"},
            {"x": 270, "y": 100, "l": "C", "p": 0}
          ],
          "b": [
            {"b": 0, "e": 1, "o": 1, "clr": "var(--chem-blue)"},
            {"b": 1, "e": 2, "o": 2, "clr": "var(--chem-green)"}
          ]
        }
      ],
      "s": [
        {"t": "Line", "x1": 135, "y1": 90, "x2": 185, "y2": 90, "a": "resonance"},
        {"t": "Pusher", "o1": "a2", "o2": "b1", "e": 2},
        {"t": "Pusher", "o1": "b0", "o2": "a0", "e": 2}
      ]
    }
  :::
  
  在 $\\text{CH}_2{=}\\text{CH}{-}\\text{CH}_2^-$ 中，<ce style="color:var(--chem-green)">右侧碳原子</ce>成三根键并独占一对孤电子，故带有 $-1$ 的形式电荷。<ce style="color:var(--chem-green)">孤对电子</ce>可以流入碳单键并形成一根新的双键，使<ce style="color: var(--chem-green);">碳原子</ce>形成形式电荷为 $0$ 的稳定结构。为了维持中心碳最外层八电子稳定，左侧 <ce style="color: var(--chem-blue);">$\\pi$ 键</ce>电子被驱赶到最左侧的碳原子上，变成<ce style="color:var(--chem-indigo)">孤对电子</ce>，使之带有 $-1$ 的形式电荷（由“平分”一对电子到“完全占有”该对电子）。
  
  书写共振式的重要原则是不违反八隅体规则：除碳正离子和碳自由基外，一般来说，所有原子最外层电子数应与同周期稀有气体相同。第二周期元素对应原子最外层不可能俘获多于八电子，因为它没有 $d$ 轨道。除此以外含有多于或少于八电子原子的结构，一般也不作考虑，因为它们很不稳定，对共振杂化体的实际贡献极小。
  
  在以上两个例子中，由于各自的两种极限结构不存在稳定性差异，它们的贡献都是 $1/2$，即两个端基碳均摊了一个正/负形式电荷。
  
  下面是一个带有杂原子的例子。
  
  :::
    {
      "m": [
        {
          "i": "m1",
          "a": [
            {"x": 40, "y": 100, "l": "C"},
            {"x": 75, "y": 100, "i": "a1", "l": "C"},
            {"x": 92.5, "y": 70, "i": "a2", "l": "O", "p": 2},
            {"x": 92.5, "y": 130, "i": "a3", "l": "O", "c": -1, "p": 3, "clr": "var(--chem-amber)"}
          ],
          "b": [
            {"b": 0, "e": 1},
            {"b": 1, "e": 2, "o": 2, "i": "b1", "clr": "var(--chem-crimson)"},
            {"b": 1, "e": 3, "o": 1, "i": "b2"}
          ]
        },
        {
          "i": "m2",
          "a": [
            {"x": 240, "y": 100, "l": "C"},
            {"x": 275, "y": 100, "l": "C"},
            {"x": 292.5, "y": 70, "l": "O", "c": -1, "p": 3},
            {"x": 292.5, "y": 130, "l": "O", "p": 2}
          ],
          "b": [
            {"b": 0, "e": 1},
            {"b": 1, "e": 2, "o": 1, "clr": "var(--chem-crimson)"},
            {"b": 1, "e": 3, "o": 2, "clr": "var(--chem-amber)"}
          ]
        }
      ],
      "s": [
        {"t": "Line", "x1": 140, "y1": 100, "x2": 190, "y2": 100, "a": "resonance"},
        {"t": "Pusher", "o1": "a3", "o2": "b2", "e": 2},
        {"t": "Pusher", "o1": "b1", "o2": "a2", "e": 2}
      ]
    }
  :::
  
  醋酸根离子 $\\text{CH}_3\\text{COO}^-$ 中，电离了一个氢离子的<ce style="color:var(--chem-amber)">羟基氧</ce>带有 $-1$ 的形式电荷。<ce style="color: var(--chem-amber);">氧原子</ce><ce style="color:var(--chem-amber)">的孤对电子</ce>形成<ce style="color:var(--chem-amber)">碳氧双键</ce>；为维持中心碳满足八隅体规则，原本的<ce style="color:var(--chem-crimson)">碳氧双键 </ce> $\\pi$ 电子对被驱赶到原羰基氧上，成为一对孤电子对，并使其带上 $-1$ 的形式电荷。
  
  类似地，对于碳酸根离子 $\\text{CO}_3^{2-}$ ，有：
  
  :::
    {
      "m": [
        {
          "i": "m1",
          "a": [
            {"x": 65, "y": 100, "i": "a0", "l": "C"},
            {"x": 65, "y": 70, "i": "a1", "l": "O", "p": 2},
            {"x": 39, "y": 115, "i": "a2", "l": "O", "c": -1, "p": 3},
            {"x": 91, "y": 115, "i": "a3", "l": "O", "c": -1, "p": 3, "clr": "var(--chem-amber)"}
          ],
          "b": [
            {"b": 0, "e": 1, "o": 2, "i": "b0", "clr": "var(--chem-blue)"},
            {"b": 0, "e": 2, "o": 1, "i": "b1"},
            {"b": 0, "e": 3, "o": 1, "i": "b2"}
          ]
        },
        {
          "i": "m2",
          "a": [
            {"x": 255, "y": 100, "l": "C"},
            {"x": 255, "y": 70, "l": "O", "c": -1, "p": 3, "clr": "var(--chem-blue)"},
            {"x": 229, "y": 115, "l": "O", "c": -1, "p": 3},
            {"x": 281, "y": 115, "l": "O", "p": 2, "clr": "var(--chem-amber)"}
          ],
          "b": [
            {"b": 0, "e": 1, "o": 1},
            {"b": 0, "e": 2, "o": 1},
            {"b": 0, "e": 3, "o": 2}
          ]
        }
      ],
      "s": [
        {"t": "Line", "x1": 140, "y1": 100, "x2": 180, "y2": 100, "a": "resonance"},
        {"t": "Pusher", "o1": "a3", "o2": "b2", "e": 2},
        {"t": "Pusher", "o1": "b0", "o2": "a1", "e": 2}
      ]
    }
  :::
  
  <ce style="color:var(--chem-amber)">羟基氧</ce>孤电子对转移为双键，<ce style="color:var(--chem-blue)">$\\text{C=O}$ 双键</ce>电子转移为羰基氧孤电子对。顶部的 <ce style="color:var(--chem-blue)">$\\text{C}{=}\\text{O}$ 双键</ce>与两侧带<ce style="color:var(--chem-amber)">负电荷</ce>的氧原子交替交换角色，形成三个等价极限式，将电荷均匀分配给三个氧。
  
  以上所有示例中，各极限结构依然不存在差异。接下来介绍一些不等价的情况，并说明解释主要极限贡献结构的方式。
  
  :::
    {
      "m": [
        {
          "i": "m1",
          "a": [
            {"x": 30, "y": 100, "i": "a0", "l": "C"},
            {"x": 60, "y": 80, "i": "a1", "l": "C"},
            {"x": 90, "y": 100, "i": "a2", "l": "C"},
            {"x": 120, "y": 80, "i": "a3", "l": "C"}
          ],
          "b": [
            {"b": 0, "e": 1, "o": 2, "i": "b0", "clr": "var(--chem-blue)"},
            {"b": 1, "e": 2, "o": 1, "i": "b1"},
            {"b": 2, "e": 3, "o": 2, "i": "b2", "clr": "var(--chem-rust)"}
          ]
        },
        {
          "i": "m2",
          "a": [
            {"x": 240, "y": 100, "l": "C", "c": 1, "clr": "var(--chem-blue)"},
            {"x": 270, "y": 80, "l": "C"},
            {"x": 300, "y": 100, "l": "C"},
            {"x": 330, "y": 80, "l": "C", "c": -1, "p": 1, "clr": "var(--chem-rust)"}
          ],
          "b": [
            {"b": 0, "e": 1, "o": 1},
            {"b": 1, "e": 2, "o": 2, "clr": "var(--chem-blue)"},
            {"b": 2, "e": 3, "o": 1}
          ]
        }
      ],
      "s": [
        {"t": "Line", "x1": 150, "y1": 90, "x2": 210, "y2": 90, "a": "resonance"},
        {"t": "Pusher", "o1": "b0", "o2": "b1", "e": 2},
        {"t": "Pusher", "o1": "b2", "o2": "a3", "e": 2}
      ]
    }
  :::
  
  $\\text{1,3-}$丁二烯 $\\text{CH}_2{=}\\text{CH}{-}\\text{CH}{=}\\text{CH}_2$ 中，左侧的 <ce style="color: var(--chem-blue);">$\\pi$ 双键</ce>和右侧 <ce style="color: var(--chem-rust);">$\\pi$ 双键</ce>可以向右协同推移（向左亦可），得到左右端基碳各带一个相反的形式电荷的极限式。
  
  像这样，正负电荷在电中性体系中解离、分散在不同原子的现象称为**电荷分离**。由于这一过程须克服库仑力做功，电荷分离的极限式一般能量高，不稳定。
  
  因此，左侧无形式电荷的极限式对 $\\text{CH}_2{=}\\text{CH}{-}\\text{CH}{=}\\text{CH}_2$ 共振杂化体的贡献更大。
  
  但是，上述规则不乏反例。如甲酰胺 $\\text{HCONH}_2$：
  
  :::
    {
      "m": [
        {
          "i": "m1",
          "a": [
            {"x": 65, "y": 100, "i": "a0", "l": "C"},
            {"x": 65, "y": 70, "i": "a1", "l": "O", "p": 2, "clr": "var(--chem-blue)"},
            {"x": 91, "y": 115, "i": "a2", "l": "N", "p": 1, "clr": "var(--chem-green)"},
            {"x": 39, "y": 115, "l": "H"}
          ],
          "b": [
            {"b": 0, "e": 1, "o": 2, "i": "b0", "clr": "var(--chem-blue)"},
            {"b": 0, "e": 2, "o": 1, "i": "b1"},
            {"b": 0, "e": 3, "o": 1}
          ]
        },
        {
          "i": "m2",
          "a": [
            {"x": 255, "y": 100, "l": "C"},
            {"x": 255, "y": 70, "l": "O", "c": -1, "p": 3, "clr": "var(--chem-blue)"},
            {"x": 281, "y": 115, "l": "N", "c": 1, "clr": "var(--chem-green)"},
            {"x": 229, "y": 115, "l": "H"}
          ],
          "b": [
            {"b": 0, "e": 1, "o": 1, "clr": "var(--chem-blue)"},
            {"b": 0, "e": 2, "o": 2, "clr": "var(--chem-green)"},
            {"b": 0, "e": 3, "o": 1}
          ]
        }
      ],
      "s": [
        {"t": "Line", "x1": 140, "y1": 100, "x2": 180, "y2": 100, "a": "resonance"},
        {"t": "Pusher", "o1": "a2", "o2": "b1", "e": 2},
        {"t": "Pusher", "o1": "b0", "o2": "a1", "e": 2}
      ]
    }
  :::
  
  氮原子上有一对活跃的<ce style="color:var(--chem-green)">孤对电子</ce>。孤对电子可以朝相邻的碳移动并形成 <ce style="color:var(--chem-green)">$\\text{C=N}$ 双键</ce>，顺势将<ce style="color:var(--chem-blue)">羰基双键中的 $\\pi$ 电子</ce>驱赶到电负性更强的氧原子上。
  
  右侧共振式虽然电荷分离，但负电荷落在了电负性更强的氧原子上。氧原子对电子云的束缚更紧密，对体系能量的降低效果大于克服库仑力做功的影响，使得右式成为主要贡献式。
  
  接着考虑丙烯醛 $\\text{CH}_2{=}\\text{CH}{-}\\text{CH}{=}\\text{O}$：
  
  :::
    {
      "m": [
        {
          "i": "m1",
          "a": [
            {"x": 30, "y": 100, "i": "a0", "l": "C"},
            {"x": 60, "y": 80, "i": "a1", "l": "C"},
            {"x": 90, "y": 100, "i": "a2", "l": "C"},
            {"x": 120, "y": 80, "i": "a3", "l": "O", "p": 2, "clr": "var(--chem-blue)"}
          ],
          "b": [
            {"b": 0, "e": 1, "o": 2, "i": "b0", "clr": "var(--chem-rust)"},
            {"b": 1, "e": 2, "o": 1, "i": "b1"},
            {"b": 2, "e": 3, "o": 2, "i": "b2"}
          ]
        },
        {
          "i": "m2",
          "a": [
            {"x": 240, "y": 100, "l": "C", "c": 1, "clr": "var(--chem-rust)"},
            {"x": 270, "y": 80, "l": "C"},
            {"x": 300, "y": 100, "l": "C"},
            {"x": 330, "y": 80, "l": "O", "c": -1, "p": 3, "clr": "var(--chem-blue)"}
          ],
          "b": [
            {"b": 0, "e": 1, "o": 1},
            {"b": 1, "e": 2, "o": 2, "clr": "var(--chem-rust)"},
            {"b": 2, "e": 3, "o": 1}
          ]
        }
      ],
      "s": [
        {"t": "Line", "x1": 150, "y1": 90, "x2": 210, "y2": 90, "a": "resonance"},
        {"t": "Pusher", "o1": "b0", "o2": "b1", "e": 2},
        {"t": "Pusher", "o1": "b2", "o2": "a3", "e": 2}
      ]
    }
  :::
  
  左侧双键的 <ce style="color: var(--chem-rust);">$\\pi$ 电子</ce>流向中央作为双键，而右侧碳氧双键的电子则被推给顶端的<ce style="color: var(--chem-blue);">氧原子</ce>，作为其孤电子对。
  
  在这一共振式中，负电荷落在了电负性强的氧原子上，具有一定稳定效果。但是由于克服库仑力做功较多，主要贡献式依然是左式。
  
  竞争效应的影响虽然可以反推，但是往往难以正向判断孰强孰弱，故一般不作考察。重要的是了解如何画出这些共振极限式的过程。
  
  需要说明的是，共振式也适用于不含碳的无机官能团。例如硝基甲烷 $\\text{CH}_3\\text{NO}_2$：
  
  :::
    {
      "m": [
        {
          "i": "m1",
          "a": [
            {"x": 50, "y": 100, "l": "C"},
            {"x": 85, "y": 100, "i": "a1", "l": "N", "c": 1},
            {"x": 102.5, "y": 70, "i": "a2", "l": "O", "c": -1, "p": 3, "clr": "var(--chem-amber)"},
            {"x": 102.5, "y": 130, "i": "a3", "l": "O", "p": 2}
          ],
          "b": [
            {"b": 0, "e": 1},
            {"b": 1, "e": 2, "o": 1, "i": "b1"},
            {"b": 1, "e": 3, "o": 2, "i": "b2", "clr": "var(--chem-blue)"}
          ]
        },
        {
          "i": "m2",
          "a": [
            {"x": 230, "y": 100, "l": "C"},
            {"x": 265, "y": 100, "l": "N", "c": 1},
            {"x": 282.5, "y": 70, "l": "O", "p": 2, "clr": "var(--chem-amber)"},
            {"x": 282.5, "y": 130, "l": "O", "c": -1, "p": 3}
          ],
          "b": [
            {"b": 0, "e": 1},
            {"b": 1, "e": 2, "o": 2, "clr": "var(--chem-amber)"},
            {"b": 1, "e": 3, "o": 1, "clr": "var(--chem-blue)"}
          ]
        }
      ],
      "s": [
        {"t": "Line", "x1": 142.5, "y1": 100, "x2": 190, "y2": 100, "a": "resonance"},
        {"t": "Pusher", "o1": "a2", "o2": "b1", "e": 2},
        {"t": "Pusher", "o1": "b2", "o2": "a3", "e": 2}
      ]
    }
  :::
  
  中心 $\\text{N}$ 原子成四根键（而本应“分得”五个电子），故带 $+1$ 的形式电荷。<ce style="color:var(--chem-amber)">带负电的氧原子</ce>可以将电子推向氮氧单键，将原本 <ce style="color:var(--chem-blue)">$\\pi$ 双键</ce>电子赶到另一个氧原子上，使之带有 $-1$ 的形式电荷。 $\\text{N}$ 原子的形式电荷没有改变。
  
  读者可能已经注意到，高中化学教科书常常使用的是下述画法以描述硝基：
  
  :::
    {
      "m": [
        {
          "a": [
            {"x": 100, "y": 100, "l": "C"},
            {"x": 135, "y": 100, "l": "N"},
            {"x": 152.5, "y": 70, "l": "O", "p": 2},
            {"x": 152.5, "y": 130, "l": "O", "p": 2}
          ],
          "b": [
            {"b": 0, "e": 1, "o": 1},
            {"b": 1, "e": 2, "o": 2},
            {"b": 1, "e": 3, "o": 2}
          ]
        }
      ]
    }
  :::
  
  它并不是共振极限式，而仅仅是一个便捷记法，因为它违反了第二周期元素的八隅体规则。这一记法假设氧负离子的孤电子对转化为$\\text{N=O}$，使氮原子在均摊成键电子的规则下总共“分得”五电子，从而使得任一原子的形式电荷都为 $0$，简化了书写。
  
  芳香族化合物的共振式将于下一节与共振论在芳香亲电反应中的应用一起介绍。

  ||| some AC
  Q
  下列 A、B、C、D 均为叠氮酸 $\text{HN}_3$ 的共振结构。
  1. 请根据形式电荷，在草稿纸上补上各选项的孤对电子。
  2. 选出其中相对稳定的极限式。（不定项）
  
  Sol
  **A、C 选项**：所有 $\text{N}$ 原子均具有 $8$ 电子稳定排布，是 $\text{HN}_3$ 两个最主要的稳定共振极限式。
  
  **B 选项**：最右侧 $\text{N}$ 原子只有 $1$ 个单键和 $2$ 个孤对电子（共 $6$ 个价电子），不满足八隅体规则，结构极不稳定。
  
  **D 选项**：三元环（键角约 $60\\degree$）存在巨大的环张力，非常不稳定。
  
  A
  $\\text{H}{-}\\text{N}{=}\\text{N}^+{=}\\text{N}^-$
  
  B
  $\\text{H}{-}\\text{N}{=}\\text{N}{-}{\\text{N}}$
  
  C
  $\\text{H}{-}\\text{N}^-{-}\\text{N}^+{\\equiv}\\text{N}$
  
  D
  :::
  {
    "m": [{
      "a": [
        {"x": 50, "y": 0, "l": "N"},
        {"x": 30, "y": 34.6, "l": "N"},
        {"x": 70, "y": 34.6, "l": "N"},
        {"x": 50, "y": -30, "l": "H"}
      ],
      "b": [
        {"b": 0, "e": 1, "o": 1},
        {"b": 0, "e": 2, "o": 1},
        {"b": 1, "e": 2, "o": 2},
        {"b": 0, "e": 3, "o": 1}
      ]
    }]
  }
  :::
  |||
`
